Revit 2026 API

# TransactionAttribute Class

---

The custom transaction attribute to control the transaction behavior of the external command.

SystemObject SystemAttribute Autodesk.Revit.AttributesTransactionAttribute

**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TransactionAttribute : Attribute
```
```vb
Public Class TransactionAttribute
	Inherits Attribute
```
```cpp
public ref class TransactionAttribute : public Attribute
```
```fsharp
type TransactionAttribute =
    class
        inherit Attribute
    end
```

The TransactionAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TransactionAttribute | Constructs a new TransactionAttribute. |

|  | Name | Description |
| --- | --- | --- |
|  | Mode | Transaction mode. |
|  | TypeId | When implemented in a derived class, gets a unique identifier for this Attribute.(Inherited from Attribute) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Returns a value that indicates whether this instance is equal to a specified object.(Inherited from Attribute) |
|  | GetHashCode | Returns the hash code for this instance.(Inherited from Attribute) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDefaultAttribute | When overridden in a derived class, indicates whether the value of this instance is the default value for the derived class.(Inherited from Attribute) |
|  | Match | When overridden in a derived class, returns a value that indicates whether this instance equals a specified object.(Inherited from Attribute) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.Attributes Namespace